micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_adc_ex.c
    tmp_hal_status = HAL_ERROR;
  }

  __HAL_UNLOCK(hadc);

  return tmp_hal_status;
}
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @brief  Enter ADC deep-power-down mode
  * @note   This mode is achieved in setting DEEPPWD bit and allows to save power
  *         in reducing leakage currents. It is particularly interesting before
  *         entering stop modes.
  * @note   Setting DEEPPWD automatically clears ADVREGEN bit and disables the
  *         ADC voltage regulator. This means that this API encompasses
  *         HAL_ADCEx_DisableVoltageRegulator(). Additionally, the internal
  *         calibration is lost.
  * @note   To exit the ADC deep-power-down mode, the user is expected to
  *         resort to HAL_ADC_Init() API as well as to relaunch a calibration
  *         with HAL_ADCEx_Calibration_Start() API or to re-apply a previously
  *         saved calibration factor.
  * @param hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADCEx_EnterADCDeepPowerDownMode(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Setting of this feature is conditioned to ADC state: ADC must be ADC disabled */
  if (LL_ADC_IsEnabled(hadc->Instance) == 0UL)
  {
    LL_ADC_EnableDeepPowerDown(hadc->Instance);
    tmp_hal_status = HAL_OK;
  }
  else
  {
    tmp_hal_status = HAL_ERROR;
  }

  return tmp_hal_status;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @brief Measure ADC offset during calibration
  * @note  To measure ADC calibration offset ADC must be enabled and calibration
  *         mode should be enabled. This function is intended to be used inside
  *         function @ref HAL_ADCEx_Calibration_Start
  * @param hadc ADC handle
  * @param SingleDiff
  * @param pCalibrationFactor ADC measurement offset
  * @retval HAL status
  */
HAL_StatusTypeDef ADC_Calibration_MeasureOffset(ADC_HandleTypeDef *hadc,
                                                uint32_t SingleDiff,
                                                uint32_t *pCalibrationFactor)
{
  int32_t  calib_factor_avg = 0;
  uint32_t calibration_step;
  uint32_t tickstart;

  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  if (LL_ADC_IsEnabled(hadc->Instance) != 0UL)
  {
    /* Start ADC calibration */
    LL_ADC_StartCalibration(hadc->Instance, SingleDiff);

    do
    {
      /* Measure current ADC offset */

      /* With calibration mode enabled, start multiple conversion and           */
      /* accumulate data to compute ADC conversion offset.                      */
      /* The calibration factor will be the averaged converted value            */
      for (calibration_step = 0; calibration_step < ADC_CALIBRATION_STEPS; calibration_step++)
      {
        LL_ADC_REG_StartConversion(hadc->Instance);

        /* Wait for ADC conversion to end */
        /* Get tick count */
        tickstart = HAL_GetTick();
        while (LL_ADC_REG_IsConversionOngoing(hadc->Instance) != 0UL)
        {
          if ((HAL_GetTick() - tickstart) > ADC_CALIBRATION_TIMEOUT)
          {
            /* New check to avoid false timeout detection in case of preemption */
            if (LL_ADC_REG_IsConversionOngoing(hadc->Instance) != 0UL)
            {
              /* Update ADC state machine to error */
              SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

              /* Set ADC error code to ADC peripheral internal error */
              SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_INTERNAL);

              return HAL_ERROR;
            }
          }
        }

        calib_factor_avg += (int32_t)(LL_ADC_REG_ReadConversionData32(hadc->Instance));
      } /* end of calibration steps */

      /* Compute the average data */
      calib_factor_avg = calib_factor_avg / (int32_t)(calibration_step);

      if (SingleDiff == ADC_DIFFERENTIAL_ENDED)
      {
        /* In differential mode, subtract averaged data by 0x7FF (middle      */
        /* value for differential ended corresponding to a null offset)      */
        calib_factor_avg = calib_factor_avg - 0x7FF;
      }
      else
      {
        /* nothing to do */
      }
      if (calib_factor_avg <= 0)
      {
        if (LL_ADC_IsCalibrationOffsetEnabled(hadc->Instance) == 0UL)
        {
          LL_ADC_EnableCalibrationOffset(hadc->Instance);
        }
        else
        {
          /* If calibration additional offset is enabled, measured calibration */
          /* factor should be different than 0.                                */
          tmp_hal_status = HAL_ERROR;

          SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);
        }
      }
      else
      {
        *pCalibrationFactor = (uint32_t)(calib_factor_avg);
      }
    } while ((calib_factor_avg <= 0) && (tmp_hal_status == HAL_OK));
  }
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_INTERNAL);

    tmp_hal_status = HAL_ERROR;
  }

  return tmp_hal_status;
}


#endif /* HAL_ADC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
